---
kind: other
id: Properties.T:Autodesk.Revit.DB.IntersectionResultArrayIterator
source: html/11c45f5d-b2b8-39f8-1b9f-3aea50b2a45f.htm
---
# IntersectionResultArrayIterator Properties

Retrieves the item that is the current focus of the iterator.